from math import sqrt
import decimal

# Трикутник задано довжинами сторін. 
# Знайти довжини бісектрис трикутника, радіус вписаного і описаного кіл

# Вводимо значення сторін: 
a = int(input('Введіть а: '))
b = int(input('Введіть b: '))
c = int(input('Введіть c: '))

# Проводимо обчислення: 
lc = sqrt(a * b * (a + b + c) * (a + b - c)) / (a + b)
lb = sqrt(a * c * (a + b + c) * (a + c - b)) / (a + c)
la = sqrt(c * b * (a + b + c) * (c + b - a)) / (c + b)
p = (a + b + c) / 2
S = sqrt(p * (p - a) * (p - b) * (p - c))
r = S / p
R = (a * b * c) / (4 * S)

# Виводимо результат: 
print('Бісектриса, проведена до сторони а = ', round(la, 3), ', ... до сторони b = ', round(lb, 3), ', ... до сторони c = ', round(lc, 3))
print('Радіус вписаного кола = ', round(r, 3), 'Радіус описаного кола = ', round(R, 3))


